// Для підключення MongoDB до нашого проекту використувуемо:
//  - npm i mongodb - це офіційний пакет;
//  - npm i mongoose - рекомендований пакет.

import express from "express";
import mongoose from "mongoose";

// const HOST_DB = "mongodb+srv://iteduka:vw0KIIHyyBqAkO57@cluster0.pupubo1.mongodb.net/feedback_iteduka?retryWrites=true&w=majority&appName=Cluster0"; // після останнього слеша і перед знаком питання ми прописуємо ім'я бази в даному випадку це feedback_iteduka
// якщо ми напишимо назву бази якої не існує, то помилки не буде, просто він її сам створить і підключиться
// паролі і інші приватні данні забороняєьбся зберінати на GitHub тому цілу алресу ми перенесем в налагтування Render - Environment - +Add - new variable - key HOST_DB - value mongodb+srv://iteduka:vw0KIIHyyBqAkO57@cluster0.pupubo1.mongodb.net/feedback_iteduka?retryWrites=true&w=majority&appName=Cluster0  і переписуємо нашу змінну:

const {HOST_DB, PORT} = process.env; // або без диструкторизації const HOST_DB = process.env.HOST_DB;
// завдяки цієї конструкції наш сервер буде працювати після деплоїду, але на при локальному запуску зміна HOST_DB буде underfined, тому в конрні нашого проекта створюємо файл .env і помішаємо туди HOST_DB = mongodb+srv://iteduka:vw0KIIHyyBqAkO57@cluster0.pupubo1.mongodb.net/feedback_iteduka?retryWrites=true&w=majority&appName=Cluster0, сюди можемо ше додати PORT = 3000, після чого добавляєио файл .env в .gitignore, кріи цього встановлюємо бібліотеку npm install dotenv і додаєм імпорт:
// import dotenv from "dotenv";
// dotenv.config();               // або require("dotenv").config();
// Для перевірки чи вірно вказаний імпорт:
// console.log(process.env.PORT);    // должно вывести 3000 - це те що записано в файлі .env
// console.log(process.env.API_KEY); // должно вывести 12345 - - це те що записано в файлі .env

mongoose
  .connect(HOST_DB) // для підключення повертаємлся до веб версії MongoDB - Сonnect - Driver - і копіруємо url, незабува.чи вставити пароль
  .then(() => {
    const app = express();
    app.listen(PORT, () => console.log("The srvere running on the port 3000"));
  }) // якщо успішео підключилися то ми підключаємо наш веб сервер
  .catch((error) =>{
    console.log(error.message)
    process.exit(1) // закриває запущенні процеси
}); // якщо не успішео підключилися

// Коли у тебе проект на Node.js і він працює з MongoDB, є два різні рівні:
//    - Код проекту (Node.js, Express і т.д.) – ти його зберігаєш у GitHub/GitLab. Це місце зберігання коду, але Git сам по собі не запускає твою програму. Тобто, якщо залити код тільки в Git – він лежатиме там як архів, але працювати (відповідати на HTTP-запити) не буде;
//    - Хостинг/сервер (Render, Vercel, Railway, Heroku і т.д.) – це вже місце, де твій код реально запускається і постійно працює. Туди підтягується код з Git і запускається як сервіс (Node.js процес).

// Render бере твій репозиторій з GitHub, робить деплой (збирає, запускає, дає тобі домен).
// Тоді твій бекенд "живе" в інтернеті і може підключатися до MongoDB.

// ⚡ Чому не можна обмежитися тільки Git:
//    - GitHub = сховище коду (як флешка з історією).
//    - Render = сервер, де код реально виконується.
// Отже: 
//     - переходимо за посиланням: https://dashboard.render.com/;
//     - авторизужмося - + Add New - Web Services;
//     - Connect Git provider - GitHub;


// Є ще один спосіб приєдгатися до БД:
// const main = async() => {
//     try {
//         await mongoose.connect(process.env.DB_URI); // метод який допомогає піджднатися до БД
//         console.log("Connected to Mongo DB");
//     } catch (error) {      // обробляємо помилку в середині функції
//         console.log("Помилка", error.message)
//     }
// }

// main()
// або помилку обробляєио ьільки при визові, таким способом не всі помилки можна відслідкувати:
const main = async() => {
        await mongoose.connect(process.env.DB_URI); // метод який допомогає піджднатися до БД
        console.log("Connected to Mongo DB");
}

main().catch(console.log("Помилка", error.message))
// mongodb+srv://iteduka:vw0KIIHyyBqAkO57@cluster0.pupubo1.mongodb.net/

// Однією з переваг ODM Mongoose є те, що дані можна описати певною схемою. Експортуємо клас Schema
// const Schema = mongoose.Schema;
// Встановлюємо схему
// const cats = new Schema({
// nickname: String,
// age: Number,
// });
// required: вимагає обов'язкової наявності значення для властивості
// min та max: задають мінімальне та максимальне значення для числових даних
// minlength та maxlength: задають мінімальну та максимальну довжину для рядків
// enum: рядок повинен представляти одне зі значень у зазначеному масиві рядків enum: ["Histoty", "Action"], enum: [1, 0]
// match: рядок повинен відповідати регулярному виразу match: /^[A-Z]{1.1}[a-zA-Z\s]+$/ - перша літера велика і вона одна, потім люьі оітери і між ними може бути пробіл. email - match: /^[^\s@]+@[^\s@]+\.[^\s@]{2,}$/, phone-number match: /^\+\d{3}\s\d{3}-\d{3}-\d{3}$/ - посинається + потім 3 цифри, пробіл, три цифри тире, три цифри тире, три цифри тире.
// default: якщо нічого не вкажемо то це значення буде по зпмаовчкванню    

// mongoose.model() у Mongoose використовується для створення моделі на основі схеми.
//🔹 Схема (Schema) описує структуру документів у колекції MongoDB — які поля є, їхні типи, валідація тощо.
//🔹 Модель (Model) — це "клас", за допомогою якого ти вже працюєш з конкретною колекцією: робиш find, create, update, delete.
// mongoose.model("назва моделі", chema яка буде застовуватися);
//дану модель ми можемо використати для:
//     1. створення
// book.create({title: "Harry Potter", author: "Tom Cruise"})
