// commander — це бібліотека для стаорення CLI-інтерфейсів (командной строки).
// Тобто це консольний додаток, завдяку якому користувач може задати команду в термінал, аналогвя з Python -це input

// process.argv - це масив, який містить аргументи командного рядка, передані при запуску Node.js-скрипта.
console.log(process.argv); // [
                           //   'C:\\Program Files\\nodejs\\node.exe', // це шлях до nodejs на мому ПК
                           //   'D:\\GoIT\\my-dev-notes\\Node.js\\commander' // це шлях до файлу, який ми запистили
                           //] // інши елементи масиву - це слова, які ми будемо писати в терманалі наприклад: node commander --action list, тобто action та list це будуть слова які відобразить нам термінал відповідно на другій та третій позиції масиву

//---------------- Работа з модулем commander
import { program } from 'commander';

program
  .options("--action <type>") // До нас маж прийти команда action, яка має певне значення <type>, якщо booleon - тоді просто "--action"
  // в  .options ми описужмо всі команди які до нас можуть прийти

program.parse(); // викликаємо метод parse для перетворення строки в обьєкт 