// npx - просто запускає пакет без його встановленню;
// npm - встановлює пакет в проект;

// Створення нового проекту:

// 1. створення package.json:
//    - Автоматически (рекомендуется):
//       npm init
//    - Якщо потрібно з налаштуваннями:
//       npm init -y

// 2. встановлюємо відповідні пакети:
//    "dependencies": {     - це пакет для запуска та повноцінох роботи проекта. Команда для встановлення: npm install jcors або скорочено: npm i cors 
//         "cors": "^2.8.5"
//      }
//    "devDependendencies": { - це пакет які служать тільки для розробки проекьа, після того як проект готовій ці пакети нам не потрібні. Команда для встановлення: npm install jest --save-dev або скорочено: npm i jest -D  
//       "jest": "^2.8.5",
//       "nodemon": "^3.1.10" - пакет, який допомогає оновлювати проект під час його зміни і потрібно добавити відповідний скрипт
//      }

// 3. якщо не має то створюємо файл .gitignore В цей файл ми записужмо ті папки і файли, які не потріюно, щоб записувалися на GitHub при push, наприклад:
//  node_modules/
//  .env
//  .vscode
//  .idea

// 4. прописуємо скрипти для запуску проекта и для розробки:
//    scripts: {
//       "start": "node index", - node index - це команда в node яка запускає файл в термалі (index - це назва файлу вона може бути іншою), коли ми в терміналі напишимо npm start то VScode запустить команду node index, тобто запустить файл index.js 
//       "dev": "nodemon index"
//     }  
// скрипти start та test є зарезервовані скрипти, тому їх запуск робимо через команду npm start/test, всі інші, наприклад dev - через npm run dev


// Коли ми склонували проект нам для нього треба инсталувати всі пакети які є в package.json npm install або npm i, і всі версії пакетів встановлюються актуальні на сьогоднішний день, але якщо старий проект то актуальна версія може не спрацювати тоді за допомогою npm ci встановлюємо конкретні версії проектів, які записани в package-lock.json


//Окрім наших встановлених пакетів, ми можемо встановити глобальні пакети: npm install -g назва пакету (npm install -g yarn), але їх не буде видно у package.json. Переглянути всі встановлені глобвльні пакети можна: npm list -g