// dotenv потрібен для управління змінними середовища в додатках Node.js.
// Змінні середовища — це значення (наприклад, паролі, токени, адреси баз даних), які не зберігаються прямо в коді, а задаються окремо, щоб:
//           - підвищити безпеку,
//           - спростити конфігурацію при перенесенні між середовищами (dev, test, prod).

// Пакет dotenv завантажує змінні з файлу .env в process.env.
// встановлюємо: npm i dotenv
// створюємо файл .env в корені проекту і записуємо в нього
// Приклад: Файл .env
PORT=5000
DB_HOST=localhost
DB_USER=root
DB_PASS=supersecret

// Код з використанням
require('dotenv').config(); // Завантажуємо змінні
const express = require('express');
const app = express();

const port = process.env.PORT || 3000; // Використовуємо змінну PORT з .env, або 3000 за замовчуванням

app.listen(port, () => {
  console.log(`Сервер запущен на порту ${port}`);
});
//Тепер ти можеш звертатися до змінних через process.env.XXX.

// 🔐 Чому варто використовувати .env?
// ✅ Безпека → ти не храниш паролі і ключі в репозиториї. Файл .env додається в .gitignore.
// ✅ Гнучкість → можна легко змінювати конфігурацію без зміни коду.
// ✅ Універсальність → працює з будь-яким середовищем Node.js
// ✅ Гнучкість → можна мати .env для кожного середовища: .env.development, .env.production
// ✅ Конфігурація через змінні, а не хардкод.